<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Seeder;

class RegionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Region::truncate();

        $regions = [
            ['Алматы', 15],
            ['Нур-Султан', 16],
            ['Шымкент', 19],
            ['Алматинская область', 1],
            ['Южно-Казахстанская область', 2],
            ['Восточно-Казахстанская область', 3],
            ['Костанайская область', 4],
            ['Карагандинская область', 5],
            ['Северо-Казахстанская область', 6],
            ['Акмолинская область', 7],
            ['Павлодарская область', 8],
            ['Жамбылская область', 9],
            ['Актюбинская область', 10],
            ['Западно-Казахстанская область', 11],
            ['Кызылординская область', 12],
            ['Атырауская область', 13],
            ['Мангистауская область', 14],
            ['Туркестанская область', 20],
            ['Временный въезд', 17],
            ['Временная регистрация', 18],
        ];

        foreach ($regions as $region)
        {
            Region::create([
                'title' => $region[0],
                'esbd_id' => $region[1],
            ]);
        }
    }
}
